class HotelData {
  final String title;
  final String subTitle;
  final String image;
  final double ratingBar;
  final String details;
  HotelData(
      {this.image, this.ratingBar, this.subTitle, this.title, this.details});
}

List<HotelData> dummyHote = [
  HotelData(
      title: "هتل اسپیناس پالاس",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 5,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://ariabooking.ir//safar/upload/images/iran/dad-hotel-yazd/dad-hotel-yazd9.jpg"),
  HotelData(
      title: "هتل ویستریا تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 4,
      details:
           "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://media-cdn.tripadvisor.com/media/photo-m/1280/16/1a/ea/54/hotel-presidente-4s.jpg"),
  HotelData(
      title: "هتل پارسیان آزادی تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 5,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://www.fergushotels.com/backoffice/images/247-pool-and-building-2.jpg"),
  HotelData(
      title: "هتل پرشین پلازا تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 3,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://www.rwsentosa.com/-/media/project/non-gaming/rwsentosa/hotels/hard-rock-hotel-singapore/hardrockhotelsg-exterior.jpg?mh=666&la=en&h=666&w=1366&mw=1366&hash=7890A13D2C4FE83769F4A571B997007215155027"),
  HotelData(
      title: "هتل هما تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 2,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://d2i9a1098e7tai.cloudfront.net/hardrockhotels.com-315677683/cms/cache/v2/5b48d841e765c.jpg/840x400/fit;c:196,246,4682,3236/80/bdf53a9ba4838bb818cc3d5bafe9992f.jpg"),
  HotelData(
      title: "هتل پارسیان انقلاب تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 5,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://pix10.agoda.net/hotelImages/96605/-1/dd32d9b188d86d6d8dc40d1ff9a0ebf6.jpg?s=1024x768"),
  HotelData(
      title: "هتل آرامیس تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 4,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://www.baglionihotels.com/wp-content/themes/baglioni-hotels-new/images/schema/baglioni-hotel-london.jpg"),
  HotelData(
      title: "هتل مارلیک تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 3,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://cdn-image.travelandleisure.com/sites/default/files/1558446831/bristol-hotel-virginia-53BESTHOTELSWB19.jpg"),
  HotelData(
      title: "هتل پارسیان کوثر تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 2,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://cdn-image.travelandleisure.com/sites/default/files/1558446203/grand-villa-hotel-serbelloni-italy-43-BESTHOTELSWB19.jpg"),
  HotelData(
      title: "هتل مرکزی ایران (اسنپ‌روم) تهران ",
      subTitle: "هتل نور یکی از بهترین هتل‌های سه ستاره شهر مقدس مشهد است",
      ratingBar: 3,
      details:
          "بعد از افتتاح هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس در سال 94 در تهران، که بزرگترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل 5 ستاره بیست طبقه دارد و 700 واحد اقامتی. 400 واحد اقامتی در این هتل لوکس هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. هتل اسپيناس پالاس - كلكسيون لوكس گروه هتل هاي اسپيناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون 12 سالن گردهمایی‌اش ظرفیتی بین 50 تا 1200 نفر دارند. 42 اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده. با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.",
      image:
          "https://www.google.com/search?q=hotel&client=firefox-b-d&source=lnms&tbm=isch&sa=X&ved=0ahUKEwj96pSIluLkAhXHfFAKHdFjDfoQ_AUIESgB&biw=1366&bih=642#imgrc=gsyXaszzMa3p-M:"),
];
