
class Resturant {
  final String name;
  final String subTitle;
  final String viewData;
  final double ratingBar;
  final String image;
  final String detailes;

  Resturant({
    this.image,
    this.name, 
    this.subTitle, 
    this.ratingBar, 
    this.viewData,
    this.detailes});
}
List<Resturant> dummyData=[
  new Resturant(
    name: "رستوران پرشنگ",
    subTitle: "یییییییییی",
    ratingBar: 4.5,
    viewData: "5.6K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://www.adlers-innsbruck.com/fileadmin/_processed_/6/4/csm_restaurant-img-02_d666f4932c.jpg"
  ),
   new Resturant(
    name: "رستوران پرنده آبی",
    subTitle: "یییییییییی",
    ratingBar: 2.5,
    viewData: "13.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://www.athenaspahotel.com/media/cache/jadro_resize/rc/uJmoXtmd1563349268/jadroRoot/medias/_a1a8429.jpg"
  ),
   new Resturant(
    name: "رستوران پرشنگو",
    subTitle: "یییییییییی",
    ratingBar: 3.5,
    viewData: "1.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://www.thechediandermatt.com/images/content/mood/Big/The-Chedi-Andermatt-RESTAURANT-Main-Dining-03.jpg"
  ),
   new Resturant(
    name: "رستوران پرشنگو",
    subTitle: "یییییییییی",
    ratingBar: 2,
    viewData: "3.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://www.athenaspahotel.com/media/cache/jadro_resize/rc/uJmoXtmd1563349268/jadroRoot/medias/_a1a8429.jpg"
  ),
   new Resturant(
    name: "رستوران پرشنگو",
    subTitle: "یییییییییی",
    ratingBar: 5,
    viewData: "3.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://d1vp8nomjxwyf1.cloudfront.net/wp-content/uploads/sites/64/2016/04/07101403/Manotel-Geneve-Restaurants.jpg"
  ),
   new Resturant(
    name: "رستوران پرشنگو",
    subTitle: "یییییییییی",
    ratingBar: 1.5,
    viewData: "3.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://loulou-paris.com/wp-content/uploads/2016/07/loulou-restaurant-paris-06-1000x800.jpg"
  ),
   new Resturant(
    name: "رستوران پرشنگو",
    subTitle: "یییییییییی",
    ratingBar: 4.5,
    viewData: "2.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "http://www.realdetroitweekly.com/wp-content/uploads/2017/06/Restaurants.jpg"
  ),
   new Resturant(
    name: "رستوران پرشنگو",
    subTitle: "یییییییییی",
    ratingBar: 3.5,
    viewData: "4.2K",
    detailes: "رستوران هایی که در سال 98 بر اساس امتیازهایی که 5000 نفر از کاربران به آن‌ها داده‌اند مشخص شده‌اند. تمامی شما دوستان میتوانید از طریق وب سایت لست سکند یا اپلیکیشن لست گرام نسبت به نقد و بررسی و درج امتیاز برای رستورانهای ایران و جهان اقدام کنید و کمک کنید تا برترین رستوران ها را بر اساس نظرات و امتیازات شما مشخص و رتبه بندی نماییم.ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید.هزینه ارسال غذا منطبق با تعرفه های ارسال رستوران‌ها است. چنانچه رستوران های در محدوده، هزینه ارسالشان رایگان باشد، پولی بابت پیک پرداخت نخواهید کرد؛ اما در صورتی که هزینه‌ی ارسالشان رایگان نباشد، مبلغ آن بنا بر تعرفه های رستوران محاسبه می‌شود. ریحون به هیچ عنوان سهمی از هزینه ارسال، دریافت نخواهد کرد.",
    image: "https://cdn.londonandpartners.com/visit/london-organisations/sketch/84245-640x360-sketch-restaurant-david-shrigley-640.jpg"
  ),

];
